Repository: n8rob/corpora
Catalog: french_haitian/archive/en-ht (1).tmx
Source language: en
Languages: ht

source: You move 2 to the right.
ht: Ou fè mouvman 2 pou dwa.

source: So, -3 + 2 is -1.
ht: Se konsa,-3 plis pase 2 se-1.

source: And you can see for yourself, this all fits our traditional notion of adding and subtracting.
ht: Et, ou kapab wè pou ou menm, tout sa a pi byen chita sou nou tradisyonèl nosyon de ajout Et soustrayant.

source: If we start at -1 and we subtract 2, we should get -3.
ht: Si nou kòmanse nan-1 epi nou retire 2, nou ta dwe jwenn-3.

source: Kind of reverses this thing up here.
ht: Ti jan de bagay sa a la anwo inverse.

source: -3 +2 gets us there.
ht: -3 plis pase 2 obtient nou la.

source: And if we start there and we subtract 2 we should get back to -3.
ht: Et si nou kòmanse la ak nou retire 2 nou ta dwe tounen pou-3.

source: And we see that happens.
ht: Apre sa, nou wè sa.

source: If you start at -1, right over here, and you subtract 2, you move 2 to the left.
ht: Si ou konmanse nan-1, droit sou isit la, Apre sa, ou retire 2, ou jwe 2 sou bò gòch.

source: You get back to -3.
ht: Ou fin tounen-3.

source: So hopefully this starts to give you a sense of what it means to deal with or add and subtract negative numbers.
ht: Se konsa, sa commence ba ou yon sans de sa sa vle di pou kontra avèk ou ajoute Et retire negatif anpil moun.

source: But we are going to give a lot more examples in the next video.
ht: Men, nou pwal bay anpil ekzanp yo nan videyo kap vini an.

source: And we're actually going to see what it means to subtract a negative number.
ht: E nou aktyèlman pral wè kisa sa vle di pou retire negatif anpil.

source: All right, we're on problem number 8. They ask us which equation is equivalent 5x-2(7x+1)＝14x So I'm guessing they just want to simplify this a little bit and see if we get to one of these choices.
ht: ebyen nou nan pwoblem 8. yo mande nou qui ekwasyon ki egal 5x-2(7x+1)=14x bon mwen panse que yo jis vle simplifie sa yon ti kras e we si nou genyen youn nan chwa sa yo. ebyen an nou fel. nou komanse avek 5x-2(7x+1)=14x

source: This is I think the most obvious thing to simplify. This 2(7x+1) or we can even say -2(7x+1) so then this becomes 5x plus I'm just going to distribute the -2 times all of this.
ht: Mwen panse ke se youn nan bagay ki pi fasil pou nou simplifie. sa 2(7x+1) oubyen nou ka di -2(7x+1) ebyen sa tounin plus 5x map jiste distribuye -2 pa multiplie avek tout sa. plus -2 multiplie 17x se moins 14x. moins 14x e pui -2 multiplie 1 se moins 2 li egal 14x. an nou gade nan tout chwa sa yo yo genyen 14x sou doit ou. so yo jist vle nou simplifie sa. sa simplifie 5x, plis -14, ebyen sa se -14x moins 2 ki egal a 14x. konya nou genyen 5x-14x. ki sa 5-14 ye? ki sa?

source: It's what? -9, right?
ht: -9. se pa sa?

source: When I was about 16 years old I can remember flipping through channels at home during summer vacation, looking for a movie to watch on HBO -- and how many of you remember "Ferris Bueller's Day Off"?
ht: Lè'm te prèske gen 16 an, m'sonje ke, pandan yon vakans dete, m't'ap vire chèn televisyon lakay mwen pou'm chache yon fim pou'm gade, sou yon chèn ki rele "HBO"... kiyès la ki sonje yon fim ki rele "Jou Konje de Feris Byoulè" (Ferris Bueller's Day Off)?

source: Oh yeah, great movie, right?
ht: Se yon bèl fim, nès pa?

source: -- Well, I saw Matthew Broderick on the screen, and so I thought,
ht: Ebyen, paske'm te wè Matye Bròdrik (Matthew Broderick) sou ekran an, m'te panse, "Oh! Bèl bagay!

source: "Sweet! Ferris Bueller.
ht: Fim Feris Byoulè ya.

source: I'll watch this!"
ht: Fò'm gade sa!"

source: It wasn't Ferris Bueller.
ht: Se pa't fim Feris Byoulè ya!

source: And forgive me Matthew Broderick, I know you've done other movies besides Ferris Bueller, but that's how I remember you; you're Ferris.
ht: Epi tou, eskize'm wi Matye Bròdrik, m'konnen ke'w fè lòt fim ke fim Feris Byoulè ya, men se akoz de li ke'm sonje'w; ou se Feris.

source: But you weren't doing Ferris-y things at the time; you were doing gay things at the time.
ht: Men, se pa't bagay ke Feris konn abitye fè, ke'w t'ap fè nan fim sa ke'm t'ap gade ya; se bagay omoseksyèl ke'w ta'p fè.

source: He was in a movie called "Torch Song Trilogy."
ht: Fim sa de kiyès m'ap pale la, se yon fim ki rele "Triloji de Kantik Damou" (Torch Song Trilogy).

source: And "Torch Song Trilogy" was based on a play about this drag queen who essentially was looking for love.
ht: Fim sa, li baze sou yon pyès ki pale de yon "drag queen" ki t'ap chache lanmou.

source: Love and respect -- that's what the whole film was about.
ht: Lanmou ak respè: se de sijè prensipal fim sa.

source: And as I'm watching it, I'm realizing that they're talking about me.
ht: Epi padan'm t'ap gade'l, m'te vin reyalize ke fim nan t'ap pale de mwen.

source: Not the drag queen part -- I am not shaving my hair for anyone -- but the gay part.
ht: Pa pati ki sou "drag queen" lan; m'pa nan koupe cheve'm pou okenn moun! Men, pati ki adrese sijè de zafè moun ki omoseksyèl yo.

source: The finding love and respect, the part about trying to find your place in the world.
ht: Pli presizeman, pati ki pale de kijan moun twouve lanmou ak respè, epi kijan yo twouve plas yo nan le mond.

source: So as I'm watching this, I see this powerful scene that brought me to tears, and it stuck with me for the past 25 years.
ht: Alò pandan'm t'ap gade fim sa, m'vin rankontre yon sèn ki si tèlman pwisan ke'l te fè'm kriye, epi ki te fè yon enpresyon sou mwen ki te rete avè'm pandan 25 ane ki sot pase yo.

source: And there's this quote that the main character, Arnold, tells his mother as they're fighting about who he is and the life that he lives.
ht: Gen yon deklarasyon ke Anòl (Arnold), aktè prensipal fim lan, fè pandan ke'l t'ap goumen ak manman'l, epi ke yo de ya ta'p reflechi sou kiyès Anòl ye, avèk ki stil de vi ke'l t'ap menmen.

source: "There's one thing more -- there's just one more thing you better understand.
ht: Anòl di: "Gen sèlman yon lòt bagay ke'w dwe konprann.

source: I've taught myself to sew, cook, fix plumbing, build furniture, I can even pat myself on the back when necessary, all so I don't have to ask anyone for anything.
ht: M'montre tèt mwen kijan pou'm koud, kwit, ranje plonbri, konstwi mèb, m'ka menm felisite tèt mwen lè sa nesesè, tout sa jis pou'm pa mande moun anyen!

source: There's nothing I need from anyone except for love and respect, and anyone who can't give me those two things has no place in my life."
ht: Pa gen anyen ke'm bezwen nan men okenn moun, eksèp pou lanmou ak respè; alò, nenpòt moun ki pa ka ban'm bagay sa yo, pa gen plas nan vi'm."

source: I remember that scene like it was yesterday; I was 16, I was in tears, I was in the closet, and I'm looking at these two people, Ferris Bueller and some guy I'd never seen before, fighting for love.
ht: M'si tèlman sonje sèn sa, ke'm santi tankòm si'm te gade fim nan yè; lè sa m'te gen 16 an, dlo t'ap koule sot nan je'm, mwen pa't ko janm di pèsòn ke'm te yon òm omoseksyèl, epi, pandan ke'm t'ap gade de moun sa yo: Feris Byoulè ak yon lòt nèg ke'm pa't konnen, ap goumen pou lanmou.

source: When I finally got to a place in my life where I came out and accepted who I was, and was really quite happy, to tell you the truth, I was happily gay and I guess that's supposed to be right because gay means happy too.
ht: Lè'm te resi rive nan yon plas nan vi'm ki te pèmèt ke'm te ka devwale avèk aksepte kiyès m'ye, m'te kontan anpil, pou'm ba'w tout verite ya, m'te yon nonm omoseksyèl ki te trè kontan.

source: I realized there were a lot of people who weren't as gay as I was -- gay being happy, not gay being attracted to the same sex.
ht: M'te vin reyalize ke te gen anpil moun ki pa't kontan tankou'm ...

source: In fact, I heard that there was a lot of hate and a lot of anger and a lot of frustration and a lot of fear about who I was and the gay lifestyle.
ht: O kontrè, m'te tande ke te gen anpil rayisans ak kòlè, avèk anpil fristrasyon epi anpil moun ki te pè. o sijè de kiyès ke'm ye, e a pwopo de stil de vi omoseksyèl lan ke'm t'ap mennen.

source: Now, I'm sitting here trying to figure out "the gay lifestyle," "the gay lifestyle," and I keep hearing this word over and over and over again: lifestyle, lifestyle, lifestyle.
ht: Kounye ya, m'ap eseye konprann "stil de vi omoseksyèl" "stil de vi omoseksyèl". Sa sa vle di? Epi, chak kou m'tande moun ap repete mo sa yo: stil de vi, stil de vi, stil de vi.

source: I've even heard politicians say that the gay lifestyle is a greater threat to civilization than terrorism.
ht: M'te menm tande politisyen ap di ke stil de vi omoseksyèl la, se yon bagay ki menase sivilizasyon nou an --plis menm --ke ekzistans de zafè teworis.

source: That's when I got scared.
ht: Kou'm te tande sa, se lè sa m'te vin pè.

source: Because I'm thinking, if I'm gay and I'm doing something that's going to destroy civilization, I need to figure out what this stuff is, and I need to stop doing it right now.
ht: Paske m'ap panse: si'm omoseksyèl, epi si m'ap fè yon bagay k'ap detwi sivilizasyon, m'bezwen konnen kisa bagay sa ye, pou'm sispann fè'l kounye ya!

source: (Laughter)
ht: (Moun ki fè pati de odyans lan ap ri)

source: So, I took a look at my life, a hard look at my life, and I saw some things very disturbing.
ht: Alò, m'te gade vi'm, nan yon fason ki trè pwofond, epi'm te finalman arive wè kèlke bagay ki te trè boulvèsan.

source: And I want to begin sharing these evil things that I've been doing with you, starting with my mornings.
ht: Alò, m'vle kòmanse pataje avè'w tout bagay sa yo ki mal, ke'm konn abitye fè. M'ap kòmanse ak sa'm konn fè chak maten.

source: I drink coffee.
ht: Lè'm leve m'bwè kafe.

source: Not only do I drink coffee, I know other gay people who drink coffee.
ht: Pa sèlman sa, m'konn anpil lòt moun omoseksyèl ki bwè kafe tou.

source: I get stuck in traffic -- evil, evil traffic.
ht: M'konn ret kole nan anboutyaj dè fwa, yon anbouteyaj ki move, move.

source: Sometimes I get stuck in lines at airports.
ht: Pafwa, m'konn ret kole nan liy nan ayeropò.

source: I look around, and I go, "My God, look at all these gay people!
ht: Lè konsa, m'konn gade ozalantou, epi m'konn di, "Bondye! Gade tout moun omoseksyèl sa yo! Kèt!

source: We're all trapped in these lines! These long lines trying to get on an airplane!
ht: Nou tout bloke nan liy long sa yo, ap eseye monte yon avyon!

source: My God, this lifestyle that I'm living is so freaking evil!"
ht: Bondye'm nan, stil de vi sa ke m'ap menmen la, se vrèman yon bagay ki dyabolik!

source: I clean up.
ht: M'konn fè netwayaj.

source: This is not an actual photograph of my son's room; his is messier.
ht: Foto ki so ekran an kounye a, se pa reyèlman foto de chanm ti gason'm nan; pa'l la pi mal!

source: And because I have a 15-year-old, all I do is cook and cook and cook.
ht: Epi, paske'm gen yon pitit ki gen 15 an, tout jounnen se kwit m'ap kwit.

source: Any parents out there of teenagers?
ht: Kiyès nan paran ki la, ki gen timoun ki aje de 13 a 19 an?

source: All we do is cook for these people -- they eat two, three, four dinners a night -- it's ridiculous!
ht: Chak kou se manje poun nan fè pou moun sa yo chak swa, yo manje nenpòt de, twa, kat fwa -- sa li ridikil!

source: This is the gay lifestyle.
ht: Sa se stil de vi omoseksyèl la wi!

source: And after I'm done cooking and cleaning and standing in line and getting stuck in traffic, my partner and I, we get together and we decide that we're gonna go and have some wild and crazy fun.
ht: Epi, aprè m'fin fè manje, m'fin netwaye, kanpe nan liy, ak rete kole nan anbouteyaj, patnè'm nan avèk mwen, nou reyini epi nou deside ke nou pral byen pran plèzi nou.

source: We're usually in bed before we find out who's eliminated on "American Idol."
ht: Souvan, n'al dòmi anvan emisyon ke yo rele "Idòl Ameriken" (American Idol) fini.

source: We have to wake up and find out the next day who's still on because we're too freaking tired to hear who stays on.
ht: Se lè'n leve ke nou konn al tcheke pou'n wè rezilta emisyon sa paske nou konn twò fatige pou'n fin gade emisyon sa!

source: This is the super duper evil gay lifestyle.
ht: Se sa wi ki stil de vi omoseksyèl la, ke moun konn di ki dyabolik la!

source: Run for your heterosexual lives, people.
ht: Ou menm ki la, kouri pou'w ka sove vi eteroseksyèl ou!

source: (Applause)
ht: (Moun ki nan odyans lan ap ri epi y'ap aplodi)

source: When my partner, Steve, and I first started dating, he told me this story about penguins.
ht: Lè patnè'm nan, Étyèn (Steve), avèk mwen te fèk kòmanse relasyonn nan, li te rakonte'm yon istwa sou pengwen.

source: And I didn't know where he was going with it at first.
ht: Lè'l te fenk kòmanse rakonte istwa sa, m'pa't konn sa'l ta'p di ya.

source: He was kind of a little bit nervous when he was sharing it with me, but he told me that when a penguin finds a mate that they want to spend the rest of their life with, they present them with a pebble -- the perfect pebble.
ht: Li te yon tijan pè, lè'l ta'p pataje istwa sa avè'm, men li te di'm ke lè yon pengwen jwenn yon konpanyon avèk lekèl ke'l vle pase tout rès vi'l, li ba'l yon ti wòch --yon wòch ki san defo.

source: And then he reaches into his pocket, and he brings this out to me.
ht: Apre'l fin rakonte'm istwa sa, Étyèn mete men'l nan pòch li, epi'l montre'm sa.

source: And I looked at it, and I was like, this is really cool.
ht: Aprè ke'm te gade'l, m'te twouve ke sa te trè bèl.

source: And he says, "I want to spend the rest of my life with you."
ht: Epi'l te di'm: "M'vle pase tout rès vi'm avè'w."

source: So I wear this whenever I have to do something that makes me a little nervous, like, I don't know, a TEDx talk.
ht: Akoz de sa, m'mete kolye sa nenpòt lè ke'm gen pou'm fè yon bagay ki fè'm yon tijan enkyete, tankòm, pa egzanp, lekti de "TED" sa.

source: I wear this when I am apart from him for a long period of time.
ht: Mwen mete sa, lè'm pa kote'l pou yon peryòd tan ki long.

source: And sometimes I just wear it just because.
ht: E pafwa, mwen mete'l paske'm jis renmen mete'l.

source: How many people out there are in love? Anyone in love out there?
ht: Konbyen moun ki la, ki damou yon lòt moun?

source: You might be gay.
ht: Si'w damou, petèt ou menm tou, ou se yon omoseksyèl.

source: Because I, too, am in love, and apparently that's part of the gay lifestyle that I warned you about.
ht: Paske mwen menm tou, m'damou. Aparamman, sa fè pati de stil de vi omoseksyèl la, ke'm te avèti'w de li ya.

source: You may want to tell your spouse.
ht: Petèt, ou ka vle di mari'w oubyen madanm ou sa.

source: Who, if they're in love, might be gay as well.
ht: Si'l damou tou, moun sa, se petèt omoseksyèl ke'l ye tou.

source: How many of you are single? Any single people out there?
ht: Konbyen moun ki la ki selibatè?

source: You too might be gay!
ht: Ou menm tou, petèt se yon omoseksyèl ke'w ye!

source: Because I know some gay people who are also single.
ht: Paske, m'konn kèk moun omoseksyèl tou ki selibatè.

source: It's really scary, this gay lifestyle thing; it's super duper evil and there's no end to it!
ht: Sa vrèman efreyan, stil de vi omoseksyèl sa, son'w bagay ki trè, trè, trè, dyabolik! Epi tou, li pa gen limit.

source: It goes and goes and engulfs!
ht: Li mache'l, mache, jiskas ke'l anvayi tout bagay.

source: It's really quite silly, isn't it?
ht: Ide sa, li pa fè okenn sans, nès pa?

source: That's why I'm so happy to finally hear President Obama come out and say (Applause) that he supports -- (Applause) that he supports marriage equality.
ht: Se pou rezon sa ke'm te trè kontan lè'm te tande ke Prezidan Obama te deklare (Moun ki nan odyans lan ap aplodi) ke'l sipòte: (Moun ki nan odyans lan ap aplodi) ke'l sipòte egalite de maryaj.

source: It's a wonderful day in our country's history; it's a wonderful day in the globe's history to be able to have an actual sitting president say, enough of this -- first to himself, and then to the rest of the world.
ht: Se yon bèl jou nan istwa peyi nou; se yon jou mèveyez nan istwa mond lan tou dèske gen yon prezidan k'ap gouvène aktyèlman, ki di: ase de deskriminasyon estipid sa kont moun ki omoseksyèl yo li di sa premyeman a tèt li, epi dezyèmman a tout rès moun nan le mond antye.

source: It's wonderful.
ht: Se yon trè bèl bagay sa ye.

source: But there's something that's been disturbing me since he made that remark just a short time ago.
ht: Men gen yon bagay ki kontinye ap deranje'm depi lè'l te fè deklarasyon sa, padan jou ki fenk sot pase yo.

source: And that is, apparently, this is just another move by the gay activists that's on the gay agenda.
ht: Aparamman, gen moun ki panse ke sa se yon lòt inisyativ ke militan omoseksyèl yo ap pouswiv ki fè pati de kaye ki kontyen objektif de moun ki omoseksyèl yo.

source: And I'm disturbed by this because I've been openly gay now for quite some time.
ht: Epi, sa vrèman boulvèse'm paske sa fè lontan ke'm te anonse ke'm se yon moun omoseksyèl.

source: I've been to all of the functions, I've been to fundraisers, I've written about the topic, and I have yet to receive my copy of this gay agenda.
ht: Menm si'm kon al nan tout seremoni ofisyèl yo, avèk reyinyon kote yo rasanble lajan yo, menm si'm konn ekri sou sijè de zafè de bagay omoseksyalité sa, m'pako janm jwenn kopi de kaye ki genyen objektif de moun ki omoseksyèl yo.

source: I've paid my dues on time, (Laughter)
ht: M'toutan bay kotizasyon'm nan a lè, (Moun ki fè pati de odyans lan ap ri)

source: I've marched in gay pride flags parades and the whole nine, and I've yet to see a copy of the gay agenda.
ht: M'konn al mache nan defile de drapo ke moun omoseksyèl yo òganize, epi m'konn kontribiye nan anpil lòt fason ankò epi mwen pako wè kopi de kaye sa deki m'ap pale'w la.

source: It's very, very frustrating, and I was feeling left out, like I wasn't quite gay enough.
ht: Sa deranje'm anpil anpil, epi m'santi ke tout moun inyore'm, tankòm si'm pa't omoseksyèl ase.

source: But then something wonderful happened: I was out shopping, as I tend to do, and I came across a bootleg copy of the official gay agenda.
ht: Men yon jou, yon bagay mèveyez rive'm: kòm dabitid, mwen t'ap fè makèt, epi je'm vin tonbe sou yon kopi ilegal de kaye ofisyèl sa, ki kontyen objektif de moun omoseksyèl yo.

source: And I said to myself, "LZ, for so long, you have been denied this.
ht: Epi'm di tèt mwen, "Èlzi (LZ), sa gen lontan depi y'ap kache kaye sa pou'w pa jwenn li.

source: When you get in front of this crowd, you're gonna share the news.
ht: Lè'w rive devan moun ki la yo, ou pra'l bay nouvèl la.

source: You're gonna spread the gay agenda so no one else has to wonder, what exactly is in the gay agenda?
ht: Ou pral montre kaye sa pou tout moun pa nan devine sa'k ladan'l ankò, ki sa egzakteman ki nan kaye sa?

source: What are these gays up to?
ht: Kisa ki objektif moun omoseksyèl sa yo?

source: What do they want?"
ht: Sa yo vle konsa?"

source: So, without further ado, I will present to you, ladies and gentlemen -- now be careful, 'cause it's evil -- a copy, the official copy, of the gay agenda.
ht: Alò, san'm pa nan pale pi plis, mwen pra'l montre'w, mesyedam, fè atansyon, paske sa'k ladan'l lan, se bagay dyab --yon kopi kopi ofisyèl la, de kaye de objektif de moun omoseksyèl yo.

source: (Music)
ht: (Mizik ap jwe)

source: The gay agenda, people!
ht: Mesyedam, men sa'k nan kaye de moun ki omoseksyèl yo!

source: There it is!
ht: Men kaye ya!

source: Did you soak it all in?
ht: Èske'w konprann?

source: The gay agenda.
ht: Se sa ki nan kaye moun omoseksyèl yo wi.

source: Some of you may be calling it, what, the Constitution of the United States, is that what you call it too?
ht: Gen kèk moun pami'w ki petèt rele'l, kisa, Konstitisyon Etazini yan, èske se sa'w rele'l tou?

source: The U.S. Constitution is the gay agenda.
ht: Konstitisyon Etazini yan, li fè pati de objektif de moun ki omoseksyèl yo.

source: These gays, people like me, want to be treated like full citizens and it's all written down in plain sight.
ht: Moun omoseksyèl yo --moun tankou'm --yo vle ke sosyete ya trete yo tankòm sitwayen konplè epi tout sa ekri pou tout moun ki gen je klè wè

source: I was blown away when I saw it.
ht: Sa te fè'm yon bèl plezi lè'm te wè'l.

source: I was like, wait, this is the gay agenda?
ht: M'te mande tèt mwen: se sa ki nan kaye ya?

source: Why didn't you just call it the Constitution so I knew what you were talking about?
ht: Poukisa yo pa't jis di ke'l se Kontistisyon yan, pou'm te ka konprann de kisa yo t'ap pale ya?

source: I wouldn't have been so confused; I wouldn't have been so upset.
ht: M'tap pi byen konprann,epi m'pa ta'p fache konsa.

source: But there it is.
ht: Antouka, men li.

source: Run for your heterosexual lives.
ht: Kouri pou'w sove vi etewoseksyèl ou.

source: Did you know that in all the states where there is no shading that people who are gay, lesbian, bisexual or transgendered can be kicked out of their apartments for being gay, lesbian, bisexual or transgendered?
ht: Èske'w te konnen ke nan eta ki pa kolore yo ke moun ki omoseksyèl, lesbyèn, biseksyèl, ou byen transeksyèl pwopriyetè kay ka mete yo deyò nan apatman yo akoz ke yo se omoseksyèl, lesbyèn, biseksyèl, ou transeksyèl?

source: That's the only reason that a landlord needs to have them removed, because there's no protection from discrimination of GLBT people.
ht: Se sèl rezon sa ke pwopriyetè kay bezwen pou yo mete yo deyò paske moun sa yo pa gen okenn pwoteksyon kont diskriminasyon.

source: Did you know in the states where there's no shading that you can be fired for being gay, lesbian, bisexual or transgendered?
ht: Èske'w te konnen ke nan eta ki pa kolore yo ke yo ka revoke'w akoz ke'w se yon omoseksyèl, lesbyèn, biseksyèl, oubyen transeksyèl?

source: Not based upon the quality of your work, how long you've been there, if you stink, just if you're gay, lesbian, bisexual or transgendered.
ht: Yo pa bezwen konnen kalite de travay ke'w konn fè, si'w gen anpil tan nan travay la, ou byen si'w se yon vye travayè, depi yo konnen ke'w omoseksyèl, lesbyèn, biseksyèl, ou byen transeksyèl, yo ka revoke'w.

source: All of which flies in the face of the gay agenda, also known as the U.S. Constitution.
ht: Tout sa ka pase, menm si kaye moun omoseksyèl yo egziste, yon kaye sa ke yo osi rele Konstitisyon Etazini yan.

source: Specifically, this little amendment right here: "No state shall make or enforce any law which shall abridge the privileges or immunities of citizens of the United States."
ht: Presizeman, pati sa ki la: ki di ke, "Pa gen okenn nan eta yo ki fè pati de peyi ya, ki ka envante oubyen aplike okenn lwa ki ka afebli privilèj oubyen dwa legal de tout sitwayen de peyi Etazini yan."

source: I'm looking at you, North Carolina.
ht: M'ap pale avè'w wi, eta de Kawolin di Nò (North Carolina).

source: But you're not looking at the U.S. Constitution.
ht: Men, ou menm, ou refize obeyi Konstitisyon peyi ya.

source: This is the gay agenda: equality.
ht: Egalite, se sa wi ki objektif de moun omoseksyèl yo.

source: Not special rights, but the rights that were already written by these people -- these elitists, if you will.
ht: Se pa pou di ke y'ap mande dwa spesyal non, men yo pito vle dwa ki te deja ekri pa moun swivan sa so elit sa yo, si'w vle ba yo non sa.

source: Educated, well-dressed, (Laughter) some would dare say questionably dressed.
ht: Anpil moun ki enstwi, ki byen abiye, (Moun ki fè pati de odyans lan ap ri) gen moun ki gen dwa pa renmen jan yo abiye ya.

source: Nonetheless, our forefathers, right?
ht: Men, yo se zansèt nou kan mèm, nès pa?

source: The people that, we say, knew what they were doing when they wrote the Constitution -- the gay agenda, if you will.
ht: Se moun ke'n di ki te konn sa yo t'ap fè lè yo te ekri Konstitisyon an kaye de moun omoseksyèl yo, si'w vle rele'l sa.
